Repository: anklimsk/wpkg-express-2
Catalog: app/Locale/rus/LC_MESSAGES/cake_settings_app_validation_errors.po
Languages: ru

source: This field must contain a valid group name.
ru: Это поле должно содержать допустимое имя группы.

source: Incorrect value for checkbox
ru: Неверное значение для checkbox

source: This field must contain a valid e-mail
ru: Это поле должно содержать корректный адрес электронной почты

source: This field must contain a valid subject of e-mail
ru: Это поле должно содержать действительную тему электронной почты

source: Invalid SMTP Server
ru: Недопустимый сервер SMTP

source: Invalid port number
ru: Недопустимый номер порта

source: Invalid SMTP Username
ru: Неверное имя пользователя SMTP

source: Invalid SMTP password
ru: Неверный пароль SMTP

source: Passwords dont match
ru: Пароли не совпадают

source: This field must contain a valid limit of autocomplete between %d and %d
ru: Это поле должно содержать допустимый предел автозаполнения между %d и %d

source: This field must contain a valid company name
ru: Это поле должно содержать допустимое название организации

source: This field must contain a valid distinguished name of the search base object
ru: Это поле должно содержать допустимое уникальное имя объекта базы поиска

source: This field must contain a valid language name
ru: Это поле должно содержать допустимое название языка
