Repository: anklimsk/wpkg-express-2
Catalog: app/Locale/rus/LC_MESSAGES/default.po
Languages: ru

source: Any children of this logical check will also be removed.
ru: Любые потомки этой логической проверки также будут удалены.

source: Disabled unused hosts and profiles
ru: Отключенные неиспользуемые хосты и профили

source: WPKG Error report
ru: Отчет об ошибках WPKG

source: To view the full list of errors, click '%s'
ru: Чтобы просмотреть полный список ошибок, нажмите '%s'

source: here
ru: здесь

# time out
source: %dh
ru: %dч

# time out
source: %dm
ru: %dм

# time out
source: %ds
ru: %dс

source: Installation state of packages
ru: Состояние установки пакетов

source: State of logs
ru: Состояние журналов

source: Last modified informations
ru: Последняя изменённая информация

source: Export XML files
ru: Экспорт XML файлов

source: State of packages
ru: Состояние пакетов
