Repository: anklimsk/wpkg-express-2
Catalog: app/Locale/rus/LC_MESSAGES/default.po
Languages: ru

source: LDAP Bind RDN: RDN (cn=user,ou=users,dc=fabrikam,dc=com) for OpenLDAP or User principal name (user@fabrikam.com) for ActiveDirectory
ru: RDN Связывающий LDAP: RDN (cn=user,ou=users,dc=fabrikam,dc=com) для OpenLDAP или User principal name (user@fabrikam.com) для ActiveDirectory

source: Package ID
ru: Идентификатор пакета

source: Name
ru: Наименование

source: Notes
ru: Примечания

source: Packages
ru: Пакеты

source: Profile ID
ru: Идентификатор профиля

source: Profiles
ru: Профили

source: Host ID
ru: Идентификатор хоста

source: Hosts
ru: Хосты

source: administrator
ru: администратор

source: Parsing log files
ru: Разбор файлов журналов

source: Parsing client database files
ru: Разбор файлов баз данных клиента

source: Disabling unused hosts and profiles
ru: Отключение неиспользуемых хостов и профилей

source: Cron task of the shell
ru: Задача Cron оболочки

source: This shell is used to execute task scheduled.
ru: Эта оболочка используется для выполнения задач по расписанию.

source: Available tasks: %s.
ru: Доступные задачи: %s.

source: and
ru: и

source: This task is used to disable unused hosts and profiles scheduled.
ru: Эта задача используется для отключения неиспользуемых хостов и профилей по расписанию.

source: Disabling unused hosts and profiles in progress...
ru: Выполняется отключение неиспользуемых хостов и профилей...

source: Disabling unused hosts and profiles put in queue successfully.
ru: Отключение неиспользуемых хостов и профилей успешно помещено в очередь.

source: Disabling unused hosts and profiles put in queue unsuccessfully.
ru: Отключение неиспользуемых хостов и профилей безуспешно помещено в очередь.

source: This task is used to parse client database files scheduled.
ru: Эта задача используется для разбора файлов базы данных клиентов по расписанию.

source: Parsing client database files in progress...
ru: Выполняется разбор файлов баз данных клиента...

source: Parsing client database files put in queue successfully.
ru: Разбор файлов базы данных клиента успешно помещён в очередь.

source: Parsing client database files put in queue unsuccessfully.
ru: Разбор файлов баз данных клиента безуспешно помещён в очередь.

source: This task is used to parse log files scheduled.
ru: Эта задача используется для разбора файлов журналов по расписанию.

source: Parsing log files in progress...
ru: Выполняется разбор файлов журналов...

source: Parsing log files put in queue successfully.
ru: Разбор файлов журналов успешно помещён в очередь.

source: Parsing log files put in queue unsuccessfully.
ru: Разбор файлов журналов безуспешно помещён в очередь.

source: CakePHP Queue task for disable unused hosts and profiles.
ru: Задача очереди CakePHP для отключения неиспользуемых хостов и профилей.

source: CakePHP Queue task for generating XML.
ru: Задача очереди CakePHP для генерации XML.

source: CakePHP Queue task for import XML file.
ru: Задача очереди CakePHP для импорта XML-файла.

source: CakePHP Queue task for parsing client database files.
ru: Задача CakePHP Queue для разбора файлов базы данных клиента.

source: CakePHP Queue task for parsing log files.
ru: Задача очереди CakePHP для разбора файлов журнала.

source: CakePHP Queue task for processing group of data.
ru: Задача очереди CakePHP для обработки группы данных.

source: CakePHP Queue task for recovering state a tree.
ru: Задача очереди CakePHP для восстановления состояния дерева.

source: Package action types not found
ru: Типы действия пакета не найдены

source: Index
ru: Указатель

source: Index of types of package actions
ru: Указатель типов действий пакета

source: Adding
ru: Добавление

source: Package action type has been saved.
ru: Тип действия пакета сохранён.

source: Package action type could not be saved. Please, try again.
ru: Не удалось сохранить тип действия пакета. Пожалуйста, попробуйте ещё раз.

source: Adding package action type
ru: Добавление типа действия пакета

source: Invalid ID for package action type
ru: Недопустимый идентификатор для типа действия пакета

source: Editing
ru: Редактирование

source: Editing package action type
ru: Редактирование типа действия пакета

source: Delete package action type
ru: Удалить тип действия пакета

source: Are you sure you wish to delete this package action type?
ru: Вы действительно хотите удалить этот тип действия пакета?

source: Invalid ID for package action
ru: Недопустимый идентификатор для действия пакета

source: Viewing
ru: Просмотр

source: Information of package actions
ru: Информация о действиях пакета

source: Add action
ru: Добавить действие

source: Verify state of list actions
ru: Проверить состояния списка действий

source: Verify state of list package actions
ru: Проверка состояния списка действий пакета

source: Edit action types
ru: Изменить типы действий

source: Edit package action types
ru: Редактирование типа действия пакета

source: Invalid referrer ID or type for package action
ru: Недопустимый ссылающийся идентификатор или тип для действия пакета

source: Package action has been saved.
ru: Действие пакета сохранено.

source: Package action could not be saved. Please, try again.
ru: Не удалось сохранить действие пакета. Пожалуйста, попробуйте ещё раз.

source: Adding package action
ru: Добавление действия пакета

source: Editing package action
ru: Редактирование действия пакета

source: Verifying state list package actions
ru: Проверка состояния списка действий пакета

source: Verifying
ru: Проверка

source: Delete selected items
ru: Удалить выбранные элементы

source: Clear archive
ru: Очистить архив

source: Are you sure you wish to clear archive?
ru: Вы уверены, что хотите очистить архив?

source: Package archive
ru: Архив пакетов

source: Invalid ID for package
ru: Недопустимый идентификатор для пакета

source: Information of package archive
ru: Информация об архиве пакета

source: Add to archive
ru: Добавить в архив

source: Add current revision of package to archive
ru: Добавить текущую версию пакета в архив

source: Are you sure you wish to clear archive of this package?
ru: Вы уверены, что хотите очистить архив этого пакета?

source: Restore package
ru: Восстановить пакет

source: Restore package from archive
ru: Восстановить пакет из архива

source: Are you sure you wish to restore this package from archive?
ru: Вы действительно хотите восстановить этот пакет из архива?

source: Delete package
ru: Удалить пакет

source: Are you sure you wish to delete this package from archive?
ru: Вы уверены, что хотите удалить этот пакет из архива?

source: The package has been added to archive.
ru: Пакет добавлен в архив.

source: This package already added to archive.
ru: Этот пакет уже добавлен в архив.

source: The package could not be added to archive. Please, try again.
ru: Не удалось добавить пакет в архив. Пожалуйста, попробуйте ещё раз.

source: The archive of packages has been cleared.
ru: Архив пакетов очищен.

source: The archive of packages could not be cleared. Please, try again.
ru: Не удалось очистить архив пакетов. Пожалуйста, попробуйте ещё раз.

source: The information of package has been extracted from archive successfully.
ru: Информация о пакете успешно извлечена из архива.

source: Package information could not be restored from archive. Please try again.
ru: Не удалось восстановить информация о пакете из архива. Пожалуйста, попробуйте ещё раз.

source: Invalid ID for attributes
ru: Недопустимый идентификатор для атрибутов

source: Information of attributes
ru: Информация об атрибутах

source: Edit attributes
ru: Редактировать атрибуты

source: Editing information of this attributes
ru: Редактирование информации об этих атрибутах

source: Delete attributes
ru: Удалить атрибуты

source: Are you sure you wish to delete this attributes?
ru: Вы уверены, что хотите удалить эти атрибуты?

source: Invalid referrer ID, type or node for attributes
ru: Недопустимый ссылающийся идентификатор, тип или узел атрибутов

source: Attributes has been saved.
ru: Атрибуты сохранены.

source: Attributes could not be saved. Please, try again.
ru: Атрибуты не могут быть сохранены. Пожалуйста, попробуйте ещё раз.

source: Adding attribute
ru: Добавление атрибута

source: Editing attributes
ru: Редактирование атрибутов

source: Invalid referrer ID or type for chart
ru: Недопустимый ссылающийся идентификатор или тип для диаграммы

source: Invalid referrer ID or type for check
ru: Недопустимый ссылающийся идентификатор или тип для проверки

source: Information of checks
ru: Информация о проверках

source: Add check
ru: Добавить проверку

source: Verify state of tree checks
ru: Проверка состояния дерева проверок

source: Check has been saved.
ru: Проверка сохранена.

source: Check could not be saved. Please, try again.
ru: Не удалось сохранить проверку. Пожалуйста, попробуйте ещё раз.

source: Adding check
ru: Добавление проверки

source: Invalid ID for check
ru: Недопустимый идентификатор для проверки

source: Editing check
ru: Редактирование проверки

source: Edit settings
ru: Редактировать настройки

source: Editing settings of WPKG
ru: Редактирование настроек WPKG

source: Reset to default
ru: Восстановление по умолчанию

source: Reset WPKG configuration to default
ru: Сбросить конфигурацию WPKG по умолчанию

source: Are you sure you wish to reset WPKG configuration to default, including global variables?
ru: Вы действительно хотите сбросить конфигурацию WPKG по умолчанию, включая глобальные переменные?

source: Global variables
ru: Глобальные переменные

source: Variables of the global environment
ru: Переменные глобального окружения

source: Settings of WPKG has been saved.
ru: Настройки WPKG сохранены.

source: Settings of WPKG could not be saved. Please, try again.
ru: Не удалось сохранить настройки WPKG. Пожалуйста, попробуйте ещё раз.

source: Editing settings
ru: Редактирование настроек

source: The WPKG configuration has been set default. Information will be processed by queue.
ru: Конфигурация WPKG установлена по умолчанию. Информация будет обрабатываться по очереди.

source: The WPKG configuration could not be set default. Please, try again.
ru: Не удалось установить конфигурацию WPKG по умолчанию. Пожалуйста, попробуйте ещё раз.

source: XML failed to pass XSD schema validation
ru: XML не прошел проверку схемы XSD

source: XML created successfully. Information will be processed by queue.
ru: XML успешно создан. Информация будет обрабатываться по очереди.

source: Unable to create queue task.
ru: Невозможно создать задачу очереди.

source: XML is empty
ru: XML пуст

source: XML size exceeded. Maximum size %s.
ru: Превышен размер XML. Максимальный размер %s.

source: When updating a Package revision, the previous configuration is not archived!
ru: При обновлении ревизии Пакета предыдущая конфигурация не архивируется!

source: Inputting XML text
ru: Ввод XML-текста

source: Creating XML
ru: Создание XML

source: Record has been deleted.
ru: Запись удалена.

source: Record could not be deleted. Please, try again.
ru: Не удалось удалить запись. Пожалуйста, попробуйте ещё раз.

source: Downloading XML files
ru: Скачивание XML файлов

source: Exit code directory is empty
ru: Каталог кодов выхода пуст

source: Exit code directory
ru: Каталог кодов выхода

source: Add record
ru: Добавить запись

source: Add record of exit code directory
ru: Добавить запись каталога кодов выхода

source: Record of exit code directory has been saved.
ru: Запись каталога кодов выхода сохранена.

source: Record of exit code directory could not be saved. Please, try again.
ru: Не удалось сохранить запись каталога кодов выхода. Пожалуйста, попробуйте еще раз.

source: Adding record of exit code directory
ru: Добавление записи каталога кодов выхода

source: Invalid ID for record of exit code directory
ru: Недопустимый идентификатор для записи каталога кодов выхода

source: Editing record of exit code directory
ru: Редактирование записи каталога кодов выхода

source: Delete record
ru: Удалить запись

source: Delete record of exit code directory
ru: Удалить запись каталога кодов выхода

source: Are you sure you wish to delete this record of exit code directory?
ru: Вы уверены, что хотите удалить эту запись каталога кодов выхода?

source: Invalid ID for exit code
ru: Недопустимый идентификатор для кода выхода

source: Information of exit codes
ru: Информация о кодах выхода

source: Add exit code
ru: Добавить код выхода

source: Invalid referrer ID or type for exit code
ru: Недопустимый ссылающийся идентификатор или тип для кода выхода

source: Exit code has been saved.
ru: Код выхода сохранён.

source: Exit code could not be saved. Please, try again.
ru: Не удалось сохранить код выхода. Пожалуйста, попробуйте ещё раз.

source: Adding exit code
ru: Добавление кода выхода

source: Editing exit code
ru: Редактирование кода выхода

source: Recycle bin
ru: Корзина

source: Clear recycle bin
ru: Очистить корзину

source: Are you sure you wish to clear recycle bin?
ru: Вы уверены, что хотите очистить корзину?

source: Restore data
ru: Восстановить данные

source: Restore this data from recycle bin
ru: Восстановить эти данные из корзины

source: Are you sure you wish to restore this data from recycle bin?
ru: Вы уверены, что хотите восстановить эти данные из корзины?

source: Delete data
ru: Удалить данные

source: Are you sure you wish to delete this data from recycle bin?
ru: Вы уверены, что хотите удалить эти данные из корзины?

source: The recycle bin has been cleared.
ru: Корзина очищена.

source: The recycle bin could not be cleared. Please, try again.
ru: Не удалось очистить корзину. Пожалуйста, попробуйте ещё раз.

source: The information has been restored from recycle bin successfully.
ru: Информация успешно восстановлена из корзины.

source: The information could not be restored. Please, try again.
ru: Не удалось восстановить информацию. Пожалуйста, попробуйте ещё раз.

source: Invalid referrer ID or type for graph
ru: Недопустимый ссылающийся идентификатор или тип для графа

source: Download this graph
ru: Скачать этот граф

source: Building a graph
ru: Построение графа

source: Error on creating graph
ru: Ошибка при создании графа

source: General information
ru: Общая информация

source: Index of hosts
ru: Указатель хостов

source: Generate based on LDAP
ru: Создать на основе LDAP

source: Generate from template based on LDAP
ru: Создать из шаблона на основе LDAP

source: Build a graph
ru: Построить граф

source: Build a graph for host
ru: Построить граф для хоста

source: Verify state of list hosts
ru: Проверка состояния списка хостов

source: Verify state of list variables
ru: Проверка состояния списка переменных

source: Information of host
ru: Информация о хосте

source: Host has been saved.
ru: Хост сохранён.

source: Host could not be saved. Please, try again.
ru: Не удалось сохранить хост. Пожалуйста, попробуйте ещё раз.

source: Adding host
ru: Добавление хоста

source: Invalid ID for host
ru: Недопустимый идентификатор для хоста

source: Editing host
ru: Редактирование хоста

source: Hosts template list is empty
ru: Пустой список шаблонов хостов

source: Generating XML put in queue...
ru: Генерация XML помещена в очередь...

source: Generating XML put in queue unsuccessfully
ru: Генерация XML безуспешно помещена в очередь

source: Generating
ru: Генерирование

source: Generating host
ru: Создание хоста

source: Disabling unused hosts and profiles put in queue...
ru: Отключение неиспользуемых хостов и профилей помещено в очередь...

source: Invalid request
ru: Недопустимый запрос

source: Index of logs
ru: Указатель журналов

source: Refresh logs
ru: Обновить журналы

source: Clear logs
ru: Очистить журналы

source: Are you sure you wish to clear logs?
ru: Вы уверены, что хотите очистить журналы?

source: Previewing
ru: Предварительный просмотр

source: Preview logs of host '%s'
ru: Предварительный просмотр журналов хоста '%s'

source: Clear logs of host
ru: Очистить журналы хоста

source: Are you sure you wish to clear logs of host '%s'?
ru: Вы уверены, что хотите очистить журналы хоста '%s'?

source: Parsing logs put in queue...
ru: Разбор файлов журналов помещён в очередь...

source: Parsing logs put in queue unsuccessfully
ru: Разбор файлов журналов безуспешно помещён в очередь

source: The logs has been cleared.
ru: Журналы очищены.

source: The logs could not be cleared. Please, try again.
ru: Не удалось очистить журналы. Пожалуйста, попробуйте ещё раз.

source: Package priorities not found
ru: Приоритеты пакета не найдены

source: Index of package priorities
ru: Указатель приоритетов пакета

source: Package priority has been saved.
ru: Приоритет пакета сохранён.

source: Package priority could not be saved. Please, try again.
ru: Не удалось сохранить приоритет пакета. Пожалуйста, попробуйте ещё раз.

source: Adding package priority
ru: Добавление приоритета пакета

source: Invalid ID for package priority
ru: Недопустимый идентификатор для приоритета пакета

source: Editing package priority
ru: Редактирование приоритета пакета

source: Delete package priority
ru: Удалить приоритет пакета

source: Are you sure you wish to delete this package priority?
ru: Вы уверены, что хотите удалить этот приоритет пакета?

source: Index of packages
ru: Указатель пакетов

source: Archive
ru: Архив

source: Archive of packages
ru: Архив пакетов

source: Information of package
ru: Информация о пакете

source: Archive of package
ru: Архив пакета

source: Package has been saved.
ru: Пакет сохранён.

source: Package could not be saved. Please, try again.
ru: Не удалось сохранить пакет. Пожалуйста, попробуйте ещё раз.

source: Adding package
ru: Добавление пакета

source: Editing package
ru: Редактирование пакета

source: There are no packages to add/remove
ru: Нет пакетов для добавления/удаления

source: Exists in profiles
ru: Находиться в профилях

source: Modifying list of profiles
ru: Изменение списка профилей

source: Index of profiles
ru: Указатель профилей

source: Information of profile
ru: Информация о профиле

source: Profile has been saved.
ru: Профиль сохранён.

source: Profile could not be saved. Please, try again.
ru: Не удалось сохранить профиль. Пожалуйста, попробуйте ещё раз.

source: Adding profile
ru: Добавление профиля

source: Invalid ID for profile
ru: Недопустимый идентификатор для профиля

source: Editing profile
ru: Редактирование профиля

source: Associating packages
ru: Связывание пакетов

source: Modifying associated packages for profile
ru: Изменение связанных пакетов для профиля

source: There are no hosts to add/remove
ru: Нет хостов для добавления/удаления

source: Exists in hosts
ru: Находиться в хостах

source: Modifying list of hosts
ru: Изменение списка хостов

source: Invalid ID for package in profile
ru: Недопустимый идентификатор для пакета в профиле

source: Installation date of package has been saved.
ru: Дата установки пакета сохранена.

source: Installation date of package could not be saved. Please, try again.
ru: Дата установки пакета не может быть сохранена. Пожалуйста, попробуйте ещё раз.

source: Editing installation date of package
ru: Редактирование даты установки пакета

source: Index of reports
ru: Указатель отчётов

source: Refresh reports
ru: Обновить отчёты

source: Clear reports
ru: Очистить отчеты

source: Are you sure you wish to clear reports?
ru: Вы уверены, что хотите очистить отчеты?

source: Parsing client database files put in queue...
ru: Разбор файлов баз данных клиента помещён в очередь...

source: Parsing client database files put in queue unsuccessfully
ru: Разбор файлов баз данных клиента безуспешно помещён в очередь

source: The reports has been cleared.
ru: Отчёты очищены.

source: The reports could not be cleared. Please, try again.
ru: Не удалось очистить отчёты. Пожалуйста, попробуйте ещё раз.

source: The client database has been renamed.
ru: База данных клиента переименована.

source: The client database could not be renamed. Please, try again.
ru: Не удалось переименовать базу данных клиента. Пожалуйста, попробуйте ещё раз.

source: File selection
ru: Выбор файла

source: Uploading XML files
ru: Загрузка XML файлов

source: XML file uploaded successfully. Information will be processed by queue.
ru: Файл XML успешно загружен. Информация будет обрабатываться по очереди.

source: Invalid referrer ID or type for variable
ru: Недопустимый ссылающийся идентификатор или тип для переменной

source: Information of variables
ru: Информация о переменных

source: Add variable
ru: Добавить переменную

source: Variable has been saved.
ru: Переменная сохранена.

source: Variable could not be saved. Please, try again.
ru: Не удалось сохранить переменную. Пожалуйста, попробуйте ещё раз.

source: Adding variable
ru: Добавление переменной

source: Invalid ID for variable
ru: Недопустимый идентификатор переменной

source: Editing variable
ru: Редактирование переменной

source: WPI categories not found
ru: Категории WPI не найдены

source: Index of WPI categories
ru: Указатель категорий WPI

source: WPI category has been saved.
ru: Категория WPI сохранена.

source: WPI category could not be saved. Please, try again.
ru: Не удалось сохранить категорию WPI. Пожалуйста, попробуйте ещё раз.

source: Adding WPI category
ru: Добавление категории WPI

source: Invalid ID for WPI category
ru: Недопустимый идентификатор категории WPI

source: Editing WPI category
ru: Редактирование категории WPI

source: Delete WPI category
ru: Удалить категорию WPI

source: Are you sure you wish to delete this WPI category?
ru: Вы действительно хотите удалить эту категорию WPI?

source: Index of WPI packages
ru: Указатель пакетов WPI

source: Add package WPI
ru: Добавить пакет WPI

source: Categories
ru: Категории

source: Categories of packages
ru: Категории пакетов

source: Configuration of WPI
ru: Конфигурация WPI

source: Download WPI configuration file
ru: Скачать конфигурационный файл WPI

source: Configuration of WPKG for WPI
ru: Конфигурация WPKG для WPI

source: Download WPKG configuration file for WPI
ru: Скачать конфигурационный файл WPKG для WPI

source: Profiles of WPKG for WPI
ru: Профили WPKG для WPI

source: Download WPKG profiles file for WPI
ru: Скачать файл профилей WPKG для WPI

source: Hosts of WPKG for WPI
ru: Хосты WPKG для WPI

source: Download WPKG hosts file for WPI
ru: Скачать файл хостов WPKG для WPI

source: Invalid ID for WPI package
ru: Недопустимый идентификатор для пакета WPI

source: Information of WPI package
ru: Информация о пакете WPI

source: Edit WPI package
ru: Изменить пакет WPI

source: Delete WPI package
ru: Удалить пакет WPI

source: Are you sure you wish to delete this WPI package?
ru: Вы действительно хотите удалить этот пакет WPI?

source: Invalid XML type
ru: Недопустимый тип XML

source: List of categories of WPI is empty
ru: Список категорий WPI пуст

source: WPI package has been saved.
ru: Пакет WPI сохранён.

source: WPI package could not be saved. Please, try again.
ru: Не удалось сохранить пакет WPI. Пожалуйста, попробуйте ещё раз.

source: Adding WPI package
ru: Добавление пакета WPI

source: Editing WPI package
ru: Редактирование пакета WPI

# change state
source: selected by default
ru: выбирается по умолчанию

# change state
source: don't selected by default
ru: не выбирается по умолчанию

# change state
source: forced selected
ru: выбирается принудительно

# change state
source: don't selected forcibly
ru: не выбирается принудительно

source: Invalid target model
ru: Недопустимая целевая модель

source: Target model is not found
ru: Целевая модель не найдена

source: Invalid ID for %s
ru: Недопустимый идентификатор для %s

source: Component '%s' is not found in target controller
ru: Компонент '%s' не найден в целевом контроллере

source: The %s has been deleted.
ru: %s удалён(а).

source: The %s could not be deleted. Please, try again.
ru: Не удалось удалить %s. Пожалуйста, попробуйте ещё раз.
