Repository: anklimsk/wpkg-express-2
Catalog: app/Locale/rus/LC_MESSAGES/default.po
Languages: ru

source: An integer value (any positive non-decimal number) that indicates this package's priority. Higher priorities take precedence over lower priorities (e.g. 10).
ru: Целочисленное значение (любое положительное не десятичное число), указывающее приоритет пакета. Более высокие приоритеты имеют приоритет над более низкими приоритетами (например, 10).

source: Priorities
ru: Приоритеты

source: List of priorities.
ru: Список приоритетов.

source: Open in new window
ru: Открыть в новом окне

source: Specifies if and how the system reboots when installing, removing or upgrading a given package: - 'yes': always reboot after processing this package; - 'no': do not cause a reboot because of this package. Other packages may still cause a reboot. - 'postponed': reboot after WPKG has finished processing all packages, if the package checks are successful after the action.
ru: Указывает, будет ли система перезагружаться при установке, удалении или обновлении данного пакета: - 'да': всегда перезагружаться после обработки этого пакета; - 'нет': не вызывать перезагрузку из-за этого пакета. Другие пакеты всё ещё могут вызывать перезагрузку. - 'отложено': перезагрузка после того, как WPKG завершил обработку всех пакетов, если проверки пакетов были успешными после выполнения действия.

source: Execute
ru: Выполнение

source: Specify how the package should be executed: - 'always': execute on each synchronization - regardless of the current install state or the result of any defined checks. - 'changed': execute on each synchronization but only if there are other changes done to the system. - 'once': execute only once. No checks will be executed on following synchronization requests unless the package version on the server side is changed.
ru: Указывает, как должен выполняться пакет: - 'всегда': выполнять при каждой синхронизации - независимо от текущего состояния установки или результата каких-либо определенных проверок. - 'изменен': выполняется при каждой синхронизации, но только если в систему вносятся другие изменения. - 'один раз': выполнить только один раз. Никакие проверки не будут выполняться на следующих запросах синхронизации, если версия пакета на стороне сервера не будет изменена.

source: Notify
ru: Уведомление

source: Specify if the user should be notified about the installation of packages due to this package.
ru: Указывает, следует ли уведомлять пользователя об установке пакетов из-за этого пакета.

source: Precheck install
ru: Предпроверка установки

source: Specify how package checks are used during package installation: - 'always' (default): When a package is new to the host then first the checks are run in order to verify whether the package is already installed. If the checks succeed then it is assumed that no further installation is needed. The package is silently added to the host without executing any commands. - 'never': When a package is new to the host then the install commands are run in any case (without doing checks first). Note: Checks will still be done after package installation to verify whether installation was successful.
ru: Указывает, как проверки пакетов используются при установке пакета: - 'всегда' (по умолчанию): когда пакет является новым для хоста затем сначала выполняются проверки, чтобы убедиться, что пакет уже установлен. Если проверки пройдены успешно, предполагается, что дальнейшая установка не требуется. Пакет автоматически добавляется в хост без выполнения каких-либо команд. - 'никогда': когда пакет является новым для хоста, команды установки выполняются в любом случае (без предварительной проверки). Примечание. После установки пакета всё ещё будут выполняться проверки, чтобы убедиться, что установка прошла успешно.

source: Precheck remove
ru: Предпроверка удаления

source: Specify how package checks are used during package removal: - 'always': When a package is removed from a host then the checks will be executed before removal is processes. If the checks fail this potentially means that the package has been removed already. In such case the package remove commands will be skipped. - 'never' (default): When a package is about to be removed from the host then WPKG will execute the remove commands in any case without executing the checks first. Note: Checks will still be done after package removal to verify whether the removal was successful.
ru: Указывает, как проверки пакетов используются при удалении пакетов: - 'всегда': когда пакет удалён с хоста, проверки будут выполнены до того, как процесс удаления будет обработан. Если проверки не пройдены, это потенциально означает, что пакет уже удалён. В этом случае команды удаления пакета будут пропущены. - 'никогда' (по умолчанию): когда пакет собирается быть удалённым с хоста, WPKG выполнит команды удаления в любом случае, не выполняя проверки в первую очередь. Примечание. После удаления пакета всё ещё будут выполняться проверки, чтобы убедиться, что удаление прошло успешно.

source: Precheck upgrade
ru: Предпроверка обновления

source: Specify how package checks are used during package upgrade: - 'always': When a package is upgraded the checks specified will be be executed before the upgrade takes place. If checks succeed, then the upgrade will not be performed (WPKG just assumes that the new version is already applied correctly. Please note that your checks shall verify a specific software version and not just a generic check which is true for all versions. If your checks are true for the old version too then WPKG would never perform the upgrade in this mode. - 'never' (default): When a package is about to be upgraded then WPKG will execute the upgrade commands in any case without executing the checks first. This is the recommended behavior. Note: Checks will still be done after package upgrade to verify whether the upgrade was successful.
ru: Указывает, как проверки пакетов используются при обновлении пакета: - 'всегда': при обновлении пакета указанные проверки будут выполнены до того, как произойдет обновление. Если проверки пройдены успешно, обновление не будет выполнено (WPKG просто предполагает, что новая версия уже применена правильно. Обратите внимание, что ваши проверки должны проверять конкретную версию программного обеспечения, а не только общую проверку, которая верна для всех версий. Если ваш проверки верны и для старой версии, тогда WPKG никогда не выполнит обновление в этом режиме. - 'никогда' (по умолчанию): когда пакет будет обновлен, WPKG в любом случае выполнит команды обновления без предварительной проверки. Это рекомендуемое поведение. Примечание. После обновления пакета всё ещё будут выполняться проверки, чтобы убедиться, что обновление прошло успешно.

source: Precheck downgrade
ru: Предпроверка понижения

source: Specify how package checks are used during package downgrade: - 'always': When a package is downgraded the checks specified will be be executed before the downgrade takes place. If checks succeed, then the downgrade will not be performed (WPKG just assumes that the old version is already applied correctly. Please note that your checks shall verify a specific software version and not just a generic check which is true for all versions. If your checks are true for the new/current version too then WPKG would never perform the downgrade in this mode. - 'never' (default): When a package is about to be downgraded then WPKG will execute the downgrade commands in any case without executing the checks first. This is the recommended behavior. Note: Checks will still be done after package downgrade to verify whether the downgrade was successful.
ru: Указывает, как проверки пакетов используются во время понижения пакета: - 'всегда': когда пакет понизился, указанные проверки будут выполнены до того, как произойдет понижение рейтинга. Если проверки успешны, то понижение не будет выполнено (WPKG просто предполагает, что старая версия уже применена правильно. Обратите внимание, что ваши проверки должны проверять конкретную версию программного обеспечения, а не только общую проверку, которая верна для всех версий. Если ваши проверки верны и для новой/текущей версии, тогда WPKG никогда не выполнит понижение в этом режиме. - 'никогда' (по умолчанию): когда пакет собирается понизиться, WPKG в любом случае выполнит команды понижения, не выполнив сначала проверки. Это рекомендуемое поведение. Примечание: Проверки всё ещё будут выполняться после понижения пакета, чтобы убедиться, что понижение прошло успешно.

source: Additional notes about this package. Not used by WPKG.
ru: Дополнительные примечания об этом пакете. Не используется WPKG.

source: Depends on packages
ru: Зависит от пакетов

source: By using <i>depend</i> you make a package depending on another package, meaning that this package needs the other package for correct functionality. This dependency can already be needed during the installation or upgrade, therefore a dependency is always installed right <u>before</u> the current package independently of the priority of the packages.
ru: При использовании <i>зависимости</i> вы делаете пакет зависимым от других пакетов, это означает, что данный пакет нуждается в другом пакете для правильного функционирования. Эта зависимость может понадобится во время установки или обновления, поэтому зависимость всегда устанавливается прямо <u>перед</u> текущим пакетом независимо от приоритета пакетов.

source: Includes packages
ru: Включает пакеты

source: By using <i>include</i> you include a package to the list of packages, meaning that if you install this package the included package will also be installed. This included package will be installed <u>based on its priority</u>. So if the included package has high priority it will be installed early during synchronization. If the included package has low priority it will be installed late. If you would like to enforce a certain installation order please consider to specify a <i>dependency</i>.
ru: При использовании <i>включения</i> пакета в список пакетов, это означает, что если вы установите текущий пакет, включённый пакет также будет установлен. Включённый пакет будет установлен <u>на основе приоритета</u>. Таким образом, если включённый пакет имеет высокий приоритет, он будет установлен на ранней стадии синхронизации. Если включённый пакет имеет низкий приоритет, он будет установлен позже текущего пакета. Если вы хотите обеспечить соблюдение определенного порядка установки, пожалуйста, рассмотрите возможность указать <i>зависимость</i>.

source: Chains packages
ru: Цепочки пакетов

source: By using <i>chain</i> you chain a package to the current package, meaning that if this package is installed, the other package also has to be installed but right <u>after</u> the current package. <u>Attention</u>: a chained package might also be installed before the package chaining it. This might happen if the chained package is either already installed (possible by another dependency) or has higher priority than the package which references it by chain. If you need to ensure that a package is installed before another one please specify a <i>dependency</i>.
ru: При использовании <i>цепочки</i> вы связываете пакет с текущим пакетом, это означает, что если текущий пакет будет установлен, другой пакет также должен быть установлен, но сразу <u>после</u> текущего пакета. <u>Внимание</u>: связанный пакет также может быть установлен до пакета связанного с ним. Это может произойти, если связанный пакет либо уже установлен (возможно, с другой зависимостью), или имеет более высокий приоритет, чем пакет, который ссылается на него по цепочке. Если требуется установка перед другим пакетом, укажите <i>зависимость</i>.

source: Package ID, revision, ...
ru: Идентификатор пакета, ревизия, ...

source: Priority, reboot, ...
ru: Приоритет, перезагрузка, ...

source: Prechecks
ru: Предпроверки

source: Dependencies
ru: Зависимости

source: Profiles including this package
ru: Профили, включающие этот пакет

source: Profiles including this package.
ru: Профили, включающие этот пакет.

source: Priority name
ru: Имя приоритета

source: Name of priority the package.
ru: Название приоритета пакета.

source: Priority value
ru: Значение приоритета

source: Value of priority the package.
ru: Значение приоритета пакета.

source: Package of profile
ru: Пакет профиля

source: Editing installation date
ru: Редактирование даты установки

source: Installation date
ru: Дата установки

source: Date from which the package should be installed (this date or later). Date has to be specified in ISO 8601 format, e.g.: 2018-12-27T15:30:42+03:00.
ru: Дата, с которой пакет должен быть установлен (эта дата или позже). Дата должна быть указана в формате ISO 8601, например: 2018-12-27T15:30:42+03:00.

source: Uninstallation date
ru: Дата удаления

source: Date from which the package should be removed (this date or later). Date has to be specified in ISO 8601 format, e.g.: 2018-12-27T15:30:42+03:00.
ru: Дата, с которой пакет должен быть удален (эта дата или позже). Дата должна быть указана в формате ISO 8601, например: 2018-12-27T15:30:42+03:00.

source: Associated packages of profile
ru: Связанные пакеты профиля

source: Associated packages of this profile
ru: Связанные пакеты этого профиля

source: If enabled, this profile will appear in profiles (xml) lists.
ru: Если включен, этот профиль будет отображаться в списках профилей (xml).

source: If enabled, this profile is used as a template.
ru: Если включен, этот профиль используется в качестве шаблона.

source: Unique ID containing only letters, numbers, underscores and hyphens (e.g. base_software OR developer-suite OR complabsoft8).
ru: Уникальный идентификатор, содержащий только буквы, цифры, символы подчеркивания и дефисы (например, base_software ИЛИ Developer-suite ИЛИ complabsoft8).

source: Profiles that this profile depends on.
ru: Профили, от которых зависит этот профиль.

source: Additional notes about this profile. Not used by WPKG.
ru: Дополнительные примечания об этом профиле. Не используется WPKG .

source: Hosts containing this profile
ru: Хосты, содержащие этот профиль

source: Hosts that contain this profile as an additional associated profile.
ru: Хосты, содержащие этот профиль, в качестве дополнительного связанного профиля.

source: Data to create
ru: Данные для создания

source: Template for creating new data
ru: Шаблон для создания новых данных

source: ID text
ru: Текстовый идентификатор

source: ID text of new data
ru: Текстовый идентификатор новых данных

source: Additional attribute
ru: Дополнительный атрибут

source: Valid XML file types
ru: Допустимые типы XML файлов

source: Maximum XML file size
ru: Максимальный размер файла XML

source: Upload XML file
ru: Загрузить файл XML

source: Variable type
ru: Тип переменной

source: Variable name
ru: Имя переменной

source: Name of variable. Supports autocomplete.
ru: Имя переменной. Поддерживает автозаполнение.

source: Value of variable. Supports autocomplete.
ru: Значение переменной. Поддерживает автозаполнение.

source: Package of WPI
ru: Пакет WPI

source: Category
ru: Категория

source: Category of WPI
ru: Категория WPI

source: Default
ru: По умолчанию

source: Default checked
ru: Отмечено по умолчанию

source: Forcibly
ru: Принудительно

source: Forcibly execute package
ru: Принудительно выполнить пакет

source: Name of category.
ru: Название категории.

source: No data to display
ru: Нет данных для отображения

source: Please wait. Creating a chart in progress...
ru: Пожалуйста, подождите. Выполняется создание диаграммы...

source: Error on creating chart
ru: Ошибка при создании диаграммы

source: Add checks
ru: Добавить проверки

source: Edit checks
ru: Изменить проверки

source: Are you sure you wish to delete this record?
ru: Вы уверены, что хотите удалить эту запись?

source: Edit exit code
ru: Изменить код выхода

source: Delete exit code
ru: Удалить код выхода

source: Are you sure you wish to delete exit code '%s'?
ru: Вы действительно хотите удалить код выхода '%s'?

source: Build graph for host by name. Supports autocomplete.
ru: Построить граф для хоста по имени. Поддерживает автозаполнение.

source: Build a graph.
ru: Построить граф.

source: Show full information
ru: Показать полную информацию

source: Show full information about relations.
ru: Показать полную информацию об отношениях.

source: Please wait. Creating a graph in progress...
ru: Пожалуйста, подождите. Выполняется создание графа...

source: Position
ru: Позиция

source: Disable host
ru: Отключить хост

source: Enable host
ru: Включить хост

source: Don't use as template
ru: Не использовать в качестве шаблона

source: template
ru: шаблон

source: Use this host as a template
ru: Использовать этот хост в качестве шаблона

source: Last modified
ru: Последнее изменение

source: Basic information
ru: Основная информация

source: Extended information
ru: Расширенная информация

source: Disable package
ru: Отключить пакет

source: Enable package
ru: Включить пакет

source: Use this package as a template
ru: Использовать этот пакет в качестве шаблона

source: The automatic creation of the variable %%%s%% based on the package version is enabled
ru: Включено автоматическое создание переменной %%%s%% на основе версии пакета

source: Inclusions
ru: Включения

source: Chains
ru: Цепочки

source: Exists in dependencies
ru: Находиться в зависимостях

source: Exists in inclusions
ru: Находиться во включениях

source: Exists in chains
ru: Находиться в цепочках

source: Edit existing package in profiles
ru: Редактирование наличия пакета в профилях

# precheck
source: Install
ru: Установки

# precheck
source: Remove
ru: Удаления

# precheck
source: Upgrade
ru: Повышения

# precheck
source: Downgrade
ru: Понижения

source: Preview type
ru: Тип предварительного просмотра

source: Disable profile
ru: Отключить профиль

source: Enable profile
ru: Включить профиль

source: Use this profile as a template
ru: Использовать этот профиль в качестве шаблона

source: Depends on profiles
ru: Зависит от профилей

source: Modify list of associated packages
ru: Изменить список связанных пакетов

source: Edit existing profile in hosts
ru: Редактирование наличия профиля в хостах

source: Associated profiles
ru: Связанные профили

source: Main profiles
ru: Основные профили

source: Instal.
ru: Установ.

source: Uninst.
ru: Удален.

source: Result of verifying
ru: Результат проверки

source: Package actions type
ru: Тип действий пакета

source: Recovery state of list package actions
ru: Восстановление состояния списка действий пакета

source: Statistics
ru: Статистика

source: Show or hide move buttons
ru: Показать или скрыть кнопки перемещения

source: Edit variable
ru: Изменить переменную

source: Delete variable
ru: Удалить переменную

source: Are you sure you wish to delete variable '%s'?
ru: Вы действительно хотите удалить переменную '%s'?

source: Don't selected by default
ru: Не выбирается по умолчанию

source: Selected by default
ru: Выбран по умолчанию

source: Don't selected forcibly
ru: Не выбирается принудительно

source: Forcibly selected
ru: Выбирается принудительно

source: Edit action type
ru: Изменить тип действия

source: Delete action type
ru: Удалить тип действия

source: Are you sure you wish to delete action type '%s'?
ru: Вы действительно хотите удалить тип действия '%s'?

source: Add action type
ru: Добавить тип действия

source: View XML
ru: Просмотр XML

source: Edit package priority
ru: Изменить приоритет пакета

source: Are you sure you wish to delete package priority '%s'?
ru: Вы уверены, что хотите удалить приоритет пакета '%s'?

source: Add package priority
ru: Добавить приоритет пакета

source: Edit WPI category
ru: Изменить категорию WPI

source: Are you sure you wish to delete WPI category '%s'?
ru: Вы действительно хотите удалить категорию WPI '%s'?

source: Add WPI category
ru: Добавить категорию WPI

source: Created
ru: Создан

source: Are you sure you wish to restore package from archive '%s'?
ru: Вы действительно хотите восстановить пакет из архива '%s'?

source: Are you sure you wish to delete package '%s' from archive?
ru: Вы уверены, что хотите удалить пакет '%s' из архива?

source: Edit record
ru: Редактировать запись

source: Restore data from recycle bin
ru: Восстановить данные из корзины

source: Are you sure you wish to restore data '%s' from recycle bin?
ru: Вы действительно хотите восстановить данные '%s' из корзины?

source: Are you sure you wish to delete data '%s' from recycle bin?
ru: Вы уверены, что хотите удалить данные '%s' из корзины?

source: Graph of host
ru: Граф хоста

source: Create host from this template
ru: Создать хост из этого шаблона

source: Copy host
ru: Копировать хост

source: Are you sure you wish to copy host '%s'?
ru: Вы действительно хотите скопировать хост '%s'?

source: Edit host
ru: Редактировать хост

source: Delete host
ru: Удалить хост

source: Are you sure you wish to delete host '%s'?
ru: Вы уверены, что хотите удалить хост '%s'?

source: Created: %s
ru: Создано: %s

source: Message
ru: Сообщение

source: Date of event
ru: Дата события

source: Preview logs of host
ru: Предварительный просмотр журналов хоста

source: Delete log record
ru: Удалить запись журнала

source: Are you sure you wish to delete this log record?
ru: Вы действительно хотите удалить эту запись?

source: log
ru: журнал

source: Graph of package
ru: Граф пакета

source: Chart of installed package versions
ru: Диаграмма версий установленных пакетов

source: Create package from this template
ru: Создать пакет из этого шаблона

source: Copy package
ru: Копировать пакет

source: Are you sure you wish to copy package '%s'?
ru: Вы действительно хотите скопировать пакет '%s'?

source: Edit package
ru: Редактировать пакет

source: Are you sure you wish to delete package '%s'?
ru: Вы действительно хотите удалить пакет '%s'?

source: Includes the action: %s
ru: Включает действие: %s

source: Edit exit codes
ru: Изменить коды выхода

source: Edit package action
ru: Изменить действие пакета

source: Delete package action
ru: Удалить действие пакета

source: Are you sure you wish to delete package action '%s'?
ru: Вы уверены, что хотите удалить действие пакета '%s'?

source: Command, work directory
ru: Команда, рабочий каталог

source: Exit&nbsp;codes, reboot
ru: Коды&nbsp;выхода, перезагрузка

source: Actions
ru: Действия

source: Graph of profile
ru: Граф профиля

source: Create profile from this template
ru: Создать профиль из этого шаблона

source: Copy profile
ru: Копировать профиль

source: Are you sure you wish to copy profile '%s'?
ru: Вы действительно хотите скопировать профиль '%s'?

source: Edit profile
ru: Редактировать профиль

source: Delete profile
ru: Удалить профиль

source: Are you sure you wish to delete profile '%s'?
ru: Вы действительно хотите удалить профиль '%s'?

source: State
ru: Состояние

source: Revision of package
ru: Ревизия пакета

source: Last update
ru: Последнее обновление

source: Refresh report of host
ru: Обновить отчёт хоста

source: Are you sure you wish to refresh report of host '%s'?
ru: Вы уверены, что хотите обновить отчет хоста '%s'?

source: Clear reports of host
ru: Очистить отчеты хоста

source: Are you sure you wish to clear reports of host '%s'?
ru: Вы уверены, что хотите очистить отчеты хоста '%s'?

source: Remove (rename) client database
ru: Удалить (переименовать) базу данных клиента

source: Are you sure you wish to remove (rename) client database of host '%s'?
ru: Вы действительно хотите удалить (переименовать) клиентскую базу данных хоста '%s'?

source: Are you sure you wish to delete WPI package '%s'?
ru: Вы действительно хотите удалить пакет WPI '%s'?

source: Forced selected
ru: Выбирается принудительно

source: Edit check
ru: Изменить проверку

source: Delete check
ru: Удалить проверку

source: Are you sure you wish to delete check '%s'?
ru: Вы уверены, что хотите удалить '%s'?
