Repository: anklimsk/wpkg-express-2
Catalog: app/Locale/rus/LC_MESSAGES/default.po
Languages: ru

source: Behavior '%s' is not loaded in target model
ru: Поведение '%s' не загружено в целевую модель

source: The %s has been %s.
ru: %s %s.

source: The %s could not be %s. Please, try again.
ru: %s не удалось %s. Пожалуйста, попробуйте ещё раз.

# change state
source: enabled
ru: включен

# change state
source: disabled
ru: отключен

# change state
source: use as template
ru: используется в качестве шаблона

# change state
source: don't used as template
ru: не используется в качестве шаблона

source: Method '%s' is not found in target model
ru: Метод '%s' не найден в целевой модели

source: Preview XML
ru: Предварительный просмотр XML

source: Edit XML file
ru: Редактировать XML файл

source: Editing XML information of this %s
ru: Редактирование XML информации этого %s

source: Download XML file
ru: Скачать XML файл

source: XSD schema validation passed.
ru: Пройдена проверка схемы XSD.

source: XML updated successfully. Information will be processed by queue. After processing the information, refresh the page.
ru: XML успешно обновлен. Информация будет обрабатываться по очереди. После обработки информации, обновите страницу.

source: Editing XML
ru: Редактирование XML

source: Template list is empty
ru: Список шаблонов пуст

source: The %s has been created.
ru: %s создан.

source: The %s could not be created. Please, try again.
ru: Не удалось создать %s. Пожалуйста, попробуйте ещё раз.

source: Creating
ru: Создание

source: Creating a new %s based on the template
ru: Создание нового %s на основе шаблона

source: The %s has been copied.
ru: %s скопирован.

source: The %s could not be copied. Please, try again.
ru: Не удалось скопировать %s. Пожалуйста, попробуйте ещё раз.

source: Error on setting scope of tree (list)
ru: Ошибка настройки области дерева (списка)

source: Verifying state tree (list)
ru: Проверка состояния дерева (списка)

source: Recovery state of tree (list)
ru: Восстановление состояния дерева (списка)

source: Recovering tree (list) put in queue...
ru: Восстановление дерева (списка) помещено в очередь...

source: Recovering tree (list) put in queue unsuccessfully
ru: Восстановление дерева (списка) безуспешно помещено в очередь

source: Disable selected items
ru: Отключить выбранные элементы

source: Enable selected items
ru: Включить выбранные элементы

source: Processing selected items put in queue...
ru: Обработка выбранных элементов помещена в очередь...

source: Processing selected items put in queue unsuccessfully.
ru: Обработка выбранных элементов безуспешно помещена в очередь.

source: %s not found
ru: %s не найдены

source: Index of %s
ru: Указатель %s

source: Add %s
ru: Добавить %s

source: Create from template
ru: Создать из шаблона

source: Create %s from template
ru: Создать %s из шаблона

source: Preview full XML file
ru: Просмотр полного файла XML

source: Download XML
ru: Скачать XML

source: Download full XML file
ru: Скачать полный файл XML

source: Information of %s
ru: Информация о %s

source: Editing %s
ru: Редактировать %s

source: Editing information of this %s
ru: Редактирование информации этого %s

source: Delete %s
ru: Удалить %s

source: Are you sure you wish to delete this %s?
ru: Вы действительно хотите удалить этот %s?

source: Preview XML file
ru: Предварительный просмотр файла XML

source: Edit XML
ru: Редактировать XML

source: Editing XML file
ru: Редактирование файла XML

source: Graph of relations
ru: Граф отношений

source: Chart
ru: Диаграмма

source: Copy %s
ru: Копировать %s

source: Are you sure you wish to copy this %s?
ru: Вы действительно хотите скопировать этот %s?

source: Create %s from this template
ru: Создать %s из этого шаблона

source: Logical %s
ru: Логическое %s

source: exists
ru: существует

source: equals '%s'
ru: равно '%s'

source: unknown
ru: неизвестно

source: Registry path '%s' %s
ru: Путь реестра '%s' %s

source: bytes
ru: байтов

source: has a size = %s
ru: имеет размер = %s

source: has a version %s %s
ru: имеет версию %s %s

source: has a modify date %s %s
ru: имеет дату изменения %s %s

source: has a create date %s %s
ru: имеет дату создания %s %s

source: has a access date %s %s
ru: имеет дату доступа %s %s

source: File '%s' %s
ru: Файл '%s' %s

source: Execute '%s' and ensure the returned exit code %s
ru: Выполнить '%s' и обеспечить возвращаемый код выхода %s

source: has a version %s '%s'
ru: имеет версию %s '%s'

source: Uninstall path '%s' %s
ru: Путь удаления '%s' %s

source: Host name is '%s'
ru: Имя хоста '%s'

source: Host OS is '%s'
ru: ОС хоста '%s'

source: Host architecture is '%s'
ru: Архитектура хоста '%s'

source: Host IP addresses is '%s'
ru: IP-адреса хоста '%s'

source: Host domain name is '%s'
ru: Имя домена хоста '%s'

source: Host is group member '%s'
ru: Хост является членом группы '%s'

source: Host language ID is '%s'
ru: Идентификатор языка хоста '%s'

source: Host language ID OS is '%s'
ru: Идентификатор языка ОС хоста '%s'

source: Host environment is '%s'
ru: Окружение хоста '%s'

source: Host is unknown
ru: Хост неизвестен

# XML validation messages
source: line
ru: строка

source: Archive of the %s
ru: Архив %s

source: archive %s
ru: архив %s

source: Attributes
ru: Атрибуты

source: Attributes of the %s
ru: Атрибуты %s

source: attributes %s
ru: атрибуты %s

source: Chart of the %s
ru: Диаграмма %s

source: chart %s
ru: диаграмма %s

source: Root node
ru: Корневой узел

source: Check
ru: Проверка

source: Checks
ru: Проверки

source: Check %sof the %s
ru: Проверка %s %s

source: check %s%s
ru: проверки %s%s

source: Settings of WPKG
ru: Настройки WPKG

source: Configuration for script WPKG ver. %s
ru: Конфигурация для скрипта WPKG вер. %s

source: Invalid type for deleting record
ru: Недопустимый тип для удаления записи

source: Invalid ID for deleting record
ru: Недопустимый идентификатор для удаления записи

source: The list of computers for processing is empty
ru: Список компьютеров для обработки пуст

source: The list of hosts for processing is empty
ru: Список хостов для обработки пуст

source: Administrator of WPKG
ru: Администратор WPKG

source: Unused hosts and profiles is disabled
ru: Неиспользуемые хосты и профили отключены

source: Error on putting sending e-mail for "%s" in queue...
ru: Ошибка при помещении отправки электронной почты для "%s" в очередь...

source: Exit code
ru: Код выхода

source: Exit codes
ru: Коды выхода

source: Exit codes %sof the %s
ru: Код выхода %s %s

source: exit codes %s%s
ru: коды выхода %s%s

source: Record of exit code directory
ru: Запись каталога кодов выхода

source: Record %s of the exit code directory
ru: Запись %s каталога кодов выхода

source: record %s of the exit code directory
ru: запись %s каталога кодов выхода

source: Garbage
ru: Мусор

source: Garbage of the %s
ru: Мусор %s

source: garbage %s
ru: мусор %s

source: Graph
ru: Граф

source: Graph of the %s
ru: Граф %s

source: graph %s
ru: граф %s

source: Graph for host '%s'
ru: Граф для хоста '%s'

# graph
source: data for host
ru: данных для хоста

# graph
source: full
ru: полный

source: Use as template
ru: Использовать в качестве шаблона

source: Host
ru: Хост

source: Host '%s'
ru: Хост '%s'

source: host '%s'
ru: хоста '%s'

source: full data of hosts
ru: полные данные хостов

source: Main profile
ru: Основной профиль

source: Assoc. profile
ru: Связ. профиль

source: The list of computers for generating XML is empty
ru: Список компьютеров для генерации XML пуст

source: Invalid host template ID
ru: Неверный идентификатор шаблона хоста

source: associated %s of the %s
ru: связанного %s %s

source: Associated profile
ru: Связанный профиль

source: or
ru: или

source: Errors
ru: Ошибки

source: Variables
ru: Переменные

source: Error on settings scope
ru: Ошибка при настройке области

source: Invalid file path
ru: Недопустимый путь к файлу

source: Invalid file type. Can be one of: %s
ru: Недопустимый тип файла. Может быть одним из следующих: %s

source: Invalid input XML file
ru: Недопустимый входной файл XML

source: Input XML file is empty
ru: Входной XML-файл пуст

source: Invalid input text file
ru: Недопустимый входной текстовый файл

source: Input text file is empty
ru: Входной текстовый файл пуст

source: Invalid name of dependency model
ru: Недопустимое имя зависимой модели

source: Package actions
ru: Действия пакета

source: Error on deleting records of report
ru: Ошибка при удалении записей отчета

source: Error on saving report record
ru: Ошибка сохранения записи отчета

source: Error on saving report records
ru: Ошибка сохранения записей отчёта

source: Error on saving WPKG configuration
ru: Ошибка при сохранении конфигурации WPKG

source: Error on saving WPKG configuration language
ru: Ошибка при сохранении языка конфигурации WPKG

source: Error on saving log record
ru: Ошибка сохранения записи журнала

source: Error on saving log records
ru: Ошибка сохранения записей журнала

source: Error on saving exit code directory
ru: Ошибка при сохранении каталога кодов выхода

source: Other messages
ru: Другие сообщения

source: Warnings
ru: Предупреждения

source: Fatal errors
ru: Неустранимые ошибки

source: Invalid path to XSD schema file
ru: Недопустимый путь к файлу схемы XSD

source: Insert %s here. Press Ctrl-Space, or type a '<' character to activate autocompletion.
ru: Вставьте %s сюда. Нажмите Ctrl-Пробел или введите символ '<', чтобы активировать автозаполнение.

source: Log record
ru: Запись журнала

source: Logs
ru: Журналы

source: Log of host %s
ru: Журнал хостов %s

source: Error processing the log files parsing.
ru: Ошибка при обработке файлов журнала.

source: Error on connection to SMB share: %s.
ru: Ошибка при подключении к SMB-ресурсу: %s.

source: No log files to parsing.
ru: Нет файлов журналов для разбора.

source: Error on retrieving log file name
ru: Ошибка при получении имени файла журнала

source: Error on copying files
ru: Ошибка при копировании файлов

source: Error on removing unused hosts
ru: Ошибка при удалении неиспользуемых хостов

source: ...And %s more %s
ru: ...И еще %s %s

source: Found new errors of WPKG
ru: Найдены новые ошибки WPKG

source: Error on sending e-mail
ru: Ошибка при отправке электронной почты

source: record
ru: запись

source: Logs of host
ru: Журналы хоста

source: Logs of host %s
ru: Журналы хоста %s

source: logs of host %s
ru: журналы хоста %s

source: The package '%s' cannot be deleted or disabled because it is exists in %s for the following packages: %s
ru: Пакет '%s' не может быть удалён или отключен, поскольку он существует в %s для следующих пакетов: %s

source: Package
ru: Пакет

source: Package '%s'
ru: Пакет '%s'

source: package '%s'
ru: пакета '%s'

source: full data of packages
ru: полные данные пакетов

source: Present in
ru: Присутствует в

source: Chart of the installed versions of the package '%s'
ru: Диаграмма установленных версий пакета '%s'

# check disable
source: dependencies
ru: зависимостях

# check disable
source: inclusions
ru: включениях

# check disable
source: chains
ru: цепочках

# dependency
source: Depends on
ru: Зависит от

# dependency
source: Includes on
ru: Включает

# dependency
source: Chain on
ru: Цепочки

source: Command
ru: Команда

source: Include
ru: Включает

source: Package action
ru: Действие пакета

source: Action(s) %sof the %s
ru: Действие(я) %s %s

source: action(s) %s%s
ru: действие(я) %s%s

source: The action type of the package cannot be removed because it is used in %d %s.
ru: Тип действия пакета не может быть удалён, поскольку он используется в %d %s.

source: Action type
ru: Тип действия

source: Action types
ru: Типы действий

source: Package action type %s
ru: Тип действия пакета %s

source: package action type %s
ru: тип действия пакета %s

source: Package priority
ru: Приоритет пакета

source: Package priorities
ru: Приоритеты пакета

source: Package priority %s
ru: Приоритет пакета%s

source: package priority %s
ru: приоритет пакета %s

source: chain %s of the %s
ru: цепочки %s для %s

source: Chain of package
ru: Цепочка пакета

source: inclusion %s of the %s
ru: включения %s для %s

source: Includes of package
ru: Включает пакет

source: dependency %s of the %s
ru: зависимости %s от %s

source: Dependency of package
ru: Зависимость пакета

# attribute
source: Associated packages
ru: Связанные пакеты

source: Associated packages
ru: Связанные пакеты

source: The profile '%s' cannot be deleted or disabled because it is the main profile for the following hosts: %s
ru: Профиль '%s' не может быть удалён или отключен, поскольку он является основным профилем для следующих хостов: %s

source: Profile
ru: Профиль

source: Profile '%s'
ru: Профиль '%s'

source: profile '%s'
ru: профиля '%s'

source: full data of profiles
ru: полные данные профилей

source: Through main profile
ru: Через основной профиль

source: Through dependent profile
ru: Через зависимый профиль

source: Through prof. assoc. host
ru: Через проф. связ. с хостом

source: Contains
ru: Содержит

source: Dependency of profile
ru: Зависимость профиля

source: Invalid arguments
ru: Недопустимые аргументы

source: Error on recovering tree (list)
ru: Ошибка при восстановлении дерева (списка)

source: Report
ru: Отчёт

source: Reports
ru: Отчёты

source: Report of host %s
ru: Отчет хоста %s

source: Error processing the database files parsing.
ru: Ошибка при обработке файлов базы данных.

source: No database files to parsing.
ru: Нет файлов базы данных для разбора.

source: Host %s of report
ru: Хост %s отчёта

source: Variable
ru: Переменная

source: Variable %sof the %s
ru: Переменная %s%s

source: variable %s%s
ru: переменной %s%s

source: global environment
ru: глобального окружения

source: WPI package
ru: Пакет WPI

source: WPI packages
ru: Пакеты WPI

source: WPI package %s
ru: Пакет WPI %s

source: The category of WPI cannot be removed because it is used in %d %s.
ru: Категория WPI не может быть удалена, поскольку она используется в %d %s.

source: WPI category
ru: Категория WPI

source: WPI categories
ru: Категории WPI

source: WPI category %s
ru: Категория WPI %s

source: Field '%s' is not found in model %s
ru: Поле '%s' не найдено в модели %s

source: Method '%s' is not found in model %s
ru: Метод '%s' не найден в модели %s

source: Invalid name of main model for model '%s'
ru: Недопустимое имя основной модели для модели '%s'

source: Invalid name of dependency model for model '%s'
ru: Недопустимое имя модели зависимости для модели '%s'

source: Invalid dependency ID attribute for model '%s'
ru: Недопустимый атрибут идентификатора зависимости для модели '%s'

source: Invalid dependency element name for model '%s'
ru: Недопустимое имя элемента зависимости для модели '%s'

source: Invalid name of the cache configuration to use
ru: Недопустимое имя используемой конфигурации кэша

source: Invalid key field name
ru: Недопустимое имя ключевого поля

source: Invalid action for processing
ru: Недопустимое действие для обработки

source: Invalid condition for processing
ru: Недопустимое условие для обработки

source: The list of data for processing is empty
ru: Список данных для обработки пуст

source: Processed %s
ru: Обработанные %s

source: Error on processing: %s '%s'
ru: Ошибка при обработке: %s '%s'

source: Invalid constant prefix
ru: Недопустимый префикс константы

source: Invalid name of model for cache
ru: Недопустимое имя модели для кэша

source: PHP Extension "%s" is not loaded
ru: Расширение PHP "%s" не загружено

source: Behavior %s not loaded in %s
ru: Поведение %s не загружено в %s

source: List of packages
ru: Список пакетов

source: Add package
ru: Добавить пакет

source: Add new package
ru: Добавить новый пакет

source: Create package from template
ru: Создать пакет из шаблона

source: Manage packages
ru: Управление пакетами

source: List of profiles
ru: Список профилей

source: Add profile
ru: Добавить профиль

source: Add new profile
ru: Добавить новый профиль

source: Create profile from template
ru: Создать профиль из шаблона

source: Manage profiles
ru: Управление профилями

source: List of hosts
ru: Список хостов

source: Add host
ru: Добавить хост

source: Add new host
ru: Добавить новый хост

source: Create host from template
ru: Создать хост из шаблона

source: Disable unused
ru: Отключить неиспользуемые

source: Disable unused hosts and profiles
ru: Отключить неиспользуемые хосты и профили

source: Verify state of list
ru: Проверка состояния списка

source: Manage hosts
ru: Управление хостами

source: List of logs records
ru: Список записей журналов

source: List of packages installation state
ru: Список состояний установки пакетов

source: List of packages for WPI
ru: Список пакетов для WPI

source: Application settings
ru: Настройки приложения

source: Creating a WPKG configuration file
ru: Создание файла конфигурации WPKG

source: Queue of tasks
ru: Очередь заданий

source: Task queue list
ru: Список задач

source: Uploading XML
ru: Загрузка XML

source: Upload XML files
ru: Загрузка файлов XML

source: Downloading XML
ru: Скачивание XML

source: Download XML files
ru: Скачивание файлов XML

source: Manage removed data
ru: Управление удалёнными данными

source: Logout
ru: Выход

source: Edit installation date
ru: Изменить дату установки

source: Attribute type
ru: Тип атрибута

source: This contains the full description of the operations system, which consists of the following parts: OS-caption; OS-description; CSD-version (usually the service pack); OS-version.
ru: Содержит полное описание операционной системы, которое состоит из следующих частей: OS-заголовок; OS-описание; CSD-версия (обычно это пакет обновления); OS-версии.

source: This contains the language identifier of the operating system (e.g. 407,c07,1407).
ru: Содержит идентификатор языка операционной системы (например, 407, c07, 1407).

source: This contains the language identifier of the operating system INSTALL (e.g. 407,c07,1407).
ru: Содержит идентификатор языка операционной системы, с которым она УСТАНОВЛЕНА (например, 407, c07, 1407).

source: Not specified
ru: Не указан

source: OS
ru: ОС

source: Language ID
ru: Идентификатор языка

source: Language ID OS
ru: Идентификатор языка ОС

source: Parsing PCRE on attributes
ru: Разбор PCRE в атрибутах

source: Parsing of regular expressions in the extended attributes.
ru: Разбор регулярных выражений в расширенных атрибутах.

source: Host name
ru: Имя хоста

source: This contains the name of the system, which is also contained in the Windows environment variable %COMPUTERNAME%.
ru: Содержит имя системы, которое также содержится в переменной среды Windows %COMPUTERNAME%.

source: Architecture
ru: Архитектура

source: This contains the processor architecture of the current operating system: x86, x64 or ia64.
ru: Содержит процессорную архитектуру текущей операционной системы: x86, x64 или ia64.

source: IP addresses
ru: IP адреса

source: This contains all currently active IP addresses of the system or an empty string, if no network adapter is currently active.
ru: Содержит все активные IP-адреса системы или пустую строку, если в настоящий момент сетевой адаптер не активен.

source: Domain name
ru: Доменное имя

source: This contains the name of the domain the system belongs to or an empty string, if it is not a domain member.
ru: Содержит имя домена, к которому принадлежит система, или пустую строку, если она не является членом домена.

source: Groups
ru: Группы

source: This contains the names of all groups the system belongs to or an empty string, if it is not a member of any group.
ru: Содержит имена всех групп, к которым принадлежит система, или пустую строку, если она не является членом какой-либо группы.

source: Type, name
ru: Тип, название

source: Host name, architecture, OS type, IP addresses
ru: Имя хоста, архитектура, тип ОС, IP-адреса

source: Domain name, groups member, language ID
ru: Доменное имя, член группы, идент. языка

source: Path
ru: Путь

source: Value
ru: Значение

source: Add/remove name
ru: Добавить/удалить имя

source: Checking the Microsoft software installation registry keys (as displayed in Windows 'Add/Remove Programs' section) for the existence of a particular package. Microsoft maintains the list of applications installed and available for uninstallation in the 'HKLM\Software\Microsoft\Windows\CurrentVersion\Uninstall' registry key. The 'DisplayName' registry key is used.
ru: Проверка ключей реестра установки программного обеспечения Microsoft (как показано в разделе 'Установка и удаление программ' Windows) на наличие определенного пакета. Microsoft поддерживает список приложений, установленных и доступных для удаления, в разделе реестра 'HKLM\Software\Microsoft\Windows\CurrentVersion\Uninstall'. Используется ключ реестра 'DisplayName'.

source: Version
ru: Версия

source: The 'DisplayVersion' registry key is used
ru: Используется ключ реестра 'DisplayVersion'

source: Registry key.
ru: Ключ реестра.

source: Registry value. If you are checking the value of a DWORD, make sure to check the decimal and not the hexadecimal value.
ru: Значение реестра. Если вы проверяете значение DWORD, обязательно проверьте десятичное, а не шестнадцатеричное значение.

source: File path
ru: Путь файла

source: File version
ru: Версия файла

source: Size
ru: Размер

source: File size in bytes
ru: Размер файла в байтах

source: Date
ru: Дата

source: Format: - Relative timestamp (in minutes): * -100 Means the file timestamp is compared to the timestamp 100 minutes ago. * +50 Means the file timestamp is compared to the timestamp 50 minutes in the future. - Absolute timestamp in ISO 8601 format: * '2007-11-23 22:00' (22:00 local time). * '2007-11-23T22:00' (Both, 'T' and space delimiter are allowed). * '2007-11-23 22:00:00' (specifies seconds which default to 0 above). * '2007-11-23 22:00:00.000' (specifies milliseconds which default to 0). - You can specify the timezone as well: '2007-11-23 22:00+01:00' (22:00 CET) '2007-11-23 21:00Z' (21:00 UTC/GMT = 22:00 CET) '2007-11-23 22:00+00:00' (21:00 UTC/GMT = 22:00 CET) - File-Comparison: Prefix your value with the '@' character in order to point to a file to which the timestamp of the file referred in path is compared. Examples: * @%SystemRoot%\explorer.exe * @c:\myfile.txt - Special terms: * 'last-week' Check against timestamp of exactly one week ago (7 days). * 'last-month' Check against timestamp of exactly one month ago (30 days). * 'last-year' Check against timestamp of exactly one year ago (365 days). * 'yesterday' Check against timestamp of yesterday (24 hours ago).
ru: Формат: - Относительная временная метка (в минутах): * -100 Означает, что временная метка файла сравнивается с временной отметкой 100 минут назад. * +50 Означает, что временная метка файла сравнивается с временной отметкой 50 минут в будущем. - Абсолютная метка времени в формате ISO 8601: * '2007-11-23 22:00' (22:00 по местному времени). * '2007-11-23T22: 00' (разрешены как 'T', так и пробел). * '2007-11-23 22:00:00' (указывает секунды, значение по умолчанию выше 0). * '2007-11-23 22: 00: 00.000' (указывает миллисекунды, по умолчанию равные 0). - Вы также можете указать часовой пояс: '2007-11-23 22:00 + 01:00' (22:00 CET) '2007-11-23 21: 00Z' (21:00 UTC / GMT = 22:00 CET) '2007-11-23 22: 00 + 00: 00' (21:00 UTC / GMT = 22:00 CET) - Сравнение файлов: Поставьте перед вашим значением символ «@», чтобы указать на файл, с которым сравнивается временная метка файла, указанного в пути. Примеры: * @%SystemRoot%\explorer.exe * @c:\myfile.txt - Особые условия: * 'last-week' Проверка по отметке времени ровно неделю назад (7 дней). * 'last-month' Проверка по отметке времени ровно месяц назад (30 дней). * 'last-year' Проверка по отметке времени ровно год назад (365 дней). * 'yesterday' Проверка по метке времени вчера (24 часа назад).

source: Executable path
ru: Исполняемый путь

source: Path to the script to be executed
ru: Путь к скрипту, который будет выполнен
