Repository: anklimsk/wpkg-express-2
Catalog: app/Locale/rus/LC_MESSAGES/default.po
Languages: ru

source: Exit code for comparison
ru: Код выхода для сравнения

source: Environment
ru: Окружение

source: This contains condition for checking environment variables, e.g.: 'PKG_VER=^$'.
ru: Содержит условие для проверки переменных среды, например: 'PKG_VER=^$'.

source: Check type
ru: Тип проверки

source: Parent
ru: Предок

source: Determines where the check should be placed in the check hierarchy. All potential parents are listed in order.
ru: Определяет, где должна быть помещена проверка в иерархии проверки. Все потенциальные родители перечислены по порядку.

source: Type
ru: Тип

source: The kind of check to be performed.
ru: Вид проверки, которая будет выполнена.

source: Condition
ru: Условие

source: Describes how the check is to be carried out for the selected type.
ru: Описывает, как проверка должна выполняться для выбранного типа.

source: The contents of this field vary depending on the check type and condition.
ru: Содержимое этого поля зависит от типа и состояния проверки.

source: Save
ru: Сохранить

source: Do not consider wpkg.xml but check existence of packages
ru: Не учитывать wpkg.xml, но проверить существование пакетов

source: Force installation over existing packages
ru: Принудительная установка поверх существующих пакетов

source: Force the script to immediately quit on error
ru: Принудительный выход из скрипта при ошибке

source: Enable debug mode
ru: Включить режим отладки

source: Enable debug mode. Prints lots of ugly debug messages to event log
ru: Включить режим отладки. Печатать много страшных отладочных сообщений в журнал событий

source: Enable dryrun mode
ru: Включить режим пробного прогона

source: Enable dryrun mode. Does not apply any changes to the system. Enables debug output and disables reboot.
ru: Включить режим прогона. Не вносит какие-либо изменения в систему. Включает отладочный вывод и отключает перезагрузку.

source: Disable all log messages printed to the console
ru: Отключить все сообщения журнала, напечатанные в консоли

source: Disable all log messages printed to the console (cscript) or displayed as dialog boxes (wscript).
ru: Отключить все сообщения журнала, напечатанные в консоли (cscript) или отображаемые в виде диалоговых окон (wscript).

source: Disable user notification about WPKG actions
ru: Отключить уведомление пользователя о действиях WPKG

source: Disable user notification about WPKG actions using windows messaging.
ru: Отключить уведомление пользователя о действиях WPKG с помощью обмена сообщениями Windows.

source: Defines how long a user notification is displayed to the user
ru: Определяет, как долго пользовательское уведомление отображается пользователю

source: Defines how long a user notification is displayed to the user. After timeout has been reached the message will be closed. Specify 0 in order to specify that messages are never closed automatically
ru: Определяет, как долго пользовательское уведомление отображается пользователю. По истечении тайм-аута сообщение будет закрыто. Укажите 0, чтобы указать, что сообщения никогда не закрываются автоматически

source: Default command execution timeout
ru: Таймаут выполнения команды по умолчанию

source: This is the default timeout used when executing external commands. Each command which runs for longer than the defined amount of seconds will be be regarded as failed and WPKG will continue execution.
ru: Время ожидания по умолчанию, используемое при выполнении внешних команд. Каждая команда, которая работает дольше, чем определенное количество секунд, будет считаться неудачной, и WPKG продолжит выполнение.

source: System does not reboot regardless of need
ru: Система не перезагружается, независимо от необходимости

source: Disable export of running state to Windows registry
ru: Отключить экспорт состояния запуска в реестр Windows

source: Disable export of running state to Windows registry at HKCU\Software\WPKG\running
ru: Отключить экспорт текущего состояния в реестр Windows в HKCU\Software\WPKG\running

source: Matching of package and profile IDs is case sensitive
ru: Сопоставление идентификаторов пакета и профиля чувствительно к регистру

source: Match multiple host entries to a single host
ru: Соответствие нескольких записей хоста одному хосту

source: Disable all downloads
ru: Отключить все загрузки

source: In this mode all download instructions will be simply ignored. Exactly the same way as if they were not specified in the XML at all. Use this option with caution as your install commands might require the files downloaded in download specifications.
ru: В этом режиме все инструкции по загрузке будут просто проигнорированы. Точно так же, как если бы они вообще не были указаны в XML. Используйте этот параметр с осторожностью, так как вашим командам установки могут потребоваться файлы, загруженные в спецификации загрузки.

source: Use the specified command for rebooting
ru: Используйте указанную команду для перезагрузки

source: Use the specified command for rebooting, either with full path or relative to the location of wpkg.js. Setting rebootCmd to "special" will use tools\psshutdown.exe
ru: Использовать указанную команду для перезагрузки, либо с полным путем, либо относительно местоположения wpkg.js. Установка rebootCmd в "special" будет использовать tools\psshutdown.exe

source: Filename of the local package database
ru: Имя файла локальной базы данных пакетов

source: Filename of the local package database (client-side) stored at %SystemRoot%\system32 by default (see settings_file_path).
ru: Имя файла локальной базы данных пакета (на стороне клиента), хранящееся по адресу %SystemRoot%\system32 по умолчанию (см. settings_file_path).

source: Path to the local package database
ru: Путь к локальной базе данных пакетов

source: Path to the local package database (client-side). It is strongly suggested to NOT set this parameter at all if not required.
ru: Путь к локальной базе данных пакетов (на стороне клиента). Настоятельно советуем НЕ устанавливать этот параметр вообще, если не требуется.

source: Disable forced removal of packages
ru: Отключить принудительное удаление пакетов

source: Disable forced removal of packages if they are removed from the profile AND the package database.
ru: Отключить принудительное удаление пакетов, если они удалены из профиля и базы данных пакета.

source: Allows to disable removing of packages
ru: Позволяет отключить удаление пакетов

source: If used in conjunction with the /synchronize parameter it will just add packages but never remove them. Instead of removing a list of packages which would have been removed during that session is printed on exit. Packages are not removed from the local settings database (wpkg.xml). Therefore it will contain a list of all packages ever installed.
ru: Если он используется вместе с параметром /synchronize, он просто добавляет пакеты, но не удаляет их. Вместо удаления списка пакетов, которые были бы удалены во время этого сеанса, будет напечатано при выходе. Пакеты не удаляются из базы данных локальных настроек (wpkg.xml). Поэтому он будет содержать список всех установленных пакетов.

source: Enable status output on STDOUT
ru: Включить вывод состояния в STDOUT

source: Controls weather WPKG prints some information about its progress to STDOUT. This output can be read by another program (GUI) to display some progress bar or additional status information to the user.
ru: Управления WPKG печатает некоторую информацию о выполнении в STDOUT. Этот вывод может быть прочитан другой программой (GUI) для отображения некоторых индикаторов или дополнительной информации о состоянии для пользователя.

source: Disables the upgrade-before-remove feature
ru: Отключает функцию обновления перед удалением

source: Usually WPKG upgrades a package to the latest available version before it removes the package. This allows administrators to fix bugs in the package and assure proper removal.
ru: Обычно WPKG обновляет пакет до последней доступной версии, прежде чем он удалит пакет. Это позволяет администраторам исправить ошибки в пакете и обеспечить правильное удаление.

source: Includes host information in local wpkg.xml attributes
ru: Включает информацию о хосте в локальных атрибутах wpkg.xml

source: Allows to disable insert of host attributes to local settings DB. This is handy for testing as the current test-suite compares the local wpkg.xml database and the file will look different on all test machines if these attribute are present. This setting might be removed if all test-cases are adapted.
ru: Позволяет отключить вставку атрибутов хоста в базу данных локальных настроек. Это удобно для тестирования, поскольку текущий тестовый пакет сравнивает локальную базу данных wpkg.xml, и файл будет выглядеть по-разному на всех тестовых машинах, если они присутствуют. Этот параметр может быть удален, если все тестовые примеры адаптированы.

source: Marks volatile releases
ru: Маркирует неустойчивые релизы

source: Marks volatile releases and "inverts" the algorithm that a longer version number is newer.
ru: Маркирует неустойчивые релизы и «инвертирует» алгоритм, чтобы более длинный номер версии являлся более новым.

source: Allows to switch to remote mode
ru: Позволяет переключиться в удалённый режим

source: Allows to switch to remote mode where package verification is skipped.
ru: Позволяет переключиться в удалённый режим, когда проверка пакета пропущена.

source: Log files are appended instead of overwritten
ru: Файлы журналов добавляются вместо перезаписи

source: Specifies if the log file should be appended or overwritten.
ru: Указывает, журнал должен быть добавлен или перезаписан.

source: Log level
ru: Уровень журнала

source: Path where the logfiles are written to
ru: Путь, где записываются файлы журнала

source: This might be an UNC path on the network as well as a local path. Environment variables are expanded.
ru: Это может быть UNC-путь в сети, а также локальный путь. Переменные среды будут расширены.

source: Pattern to generate the log file name
ru: Шаблон для создания имени файла журнала

source: Recognized patterns: [HOSTNAME] replaced by the executing hostname [PROFILE] replaced by the applying profile name [YYYY] replaced by year (4 digits) [MM] replaced by month number (2 digits) [DD] replaced by the day of the month (2 digits) [hh] replaced by hour of the day (24h format, 2 digits) [mm] replaced by minutes (2 digits) [ss] replaced by seconds (2 digits)
ru: Признанные шаблоны: [HOSTNAME] заменяется именем выполняемого хоста [PROFILE] заменяется именем применяемого профиля [YYYY] заменяется годом (4 цифры) [MM] заменяется номером месяца (2 цифры) [DD] заменяется днём месяца (2 цифры) [hh] заменяется на час дня (24-х часовом формате, 2 цифры [mm] заменяется минутами (2 цифры) [ss] заменяется секундами (2 цифры)

source: Define paths where WPKG looks for XML packages files
ru: Определяет пути, в которых WPKG ищет файлы пакетов XML

source: Multiple paths can be specified using the pipe symbol (|) as paths-separrator. If any of the paths are specified WPKG will ignore the built-in defaults.
ru: Несколько путей могут быть указаны с использованием символа вертикальной черты (|) в качестве разделителя. Если какой-либо из путей задаётся, WPKG будет игнорировать встроенные пути по умолчанию.

source: Define paths where WPKG looks for XML profiles files
ru: Определяет пути, в которых WPKG ищет файлы профилей XML

source: Define paths where WPKG looks for XML hosts files
ru: Определяет пути, в которых WPKG ищет файлы хостов XML

source: Registry path
ru: Путь реестра

source: Registry path where WPKG stores its running state.
ru: Путь реестра, где WPKG сохраняет текущее состояние.

source: Flags - part 1
ru: Флаги - часть 1

source: Flags - part 2
ru: Флаги - часть 2

source: Flags - part 3
ru: Флаги - часть 3

source: Timeout, command for rebooting, ...
ru: Время ожидания, команда для перезагрузки, ...

source: Log
ru: Журнал

source: Database
ru: База данных

source: XML paths
ru: Пути XML

source: Registry paths
ru: Пути реестра

source: XML text
ru: Текст XML

source: Data
ru: Данные

source: Information
ru: Информация

source: XML type.
ru: Тип XML.

source: Press Ctrl-Space, or type a '<' character to activate autocompletion. Press Ctrl-J to jump to the tag that matches the one under the cursor.
ru: Нажмите Ctrl-Пробел или введите символ '<', чтобы активировать автозаполнение. Нажмите Ctrl-J, чтобы перейти к тегу, который соответствует тегу под курсором.

source: Maximum XML size
ru: Максимальный размер XML

source: List of silent install, upgrade and uninstall configurations for many programs
ru: Список конфигураций автоматической установки, обновления и удаления для многих программ

source: Clear
ru: Очистить

source: Create
ru: Создать

source: Update
ru: Обновить

source: Package action type
ru: Тип действия пакета

source: Exit code type
ru: Тип кода выхода

source: This is the expected exit code produced by the associated command/package action. If you don't care about exit code use 'any' or '*'. Supports autocomplete.
ru: Ожидаемый код завершения, созданный связанной командой/действием пакета. Если вас не волнует код выхода, используйте 'any' или '*'. Поддерживает автозаполнение.

source: Reboot
ru: Перезагрузка

source: Determines if and what kind of a reboot is performed when the specified exit code is detected: - 'yes': immediate reboot, without updating wpkg.xml; - 'no': do not require any reboot; - 'delayed': reboot once the package action is complete and wpkg.xml is updated; - 'postponed': reboot once all the packages have been processed.
ru: Определяет, выполняется ли и какой тип перезагрузки при обнаружении указанного кода выхода: - 'да': немедленная перезагрузка без обновления wpkg.xml; - 'нет': не требует перезагрузки; - 'задержано': перезагрузка после завершения действия пакета и обновления wpkg.xml; - 'отложено': перезагрузить, как только все пакеты будут обработаны.

source: Value of exit code.
ru: Значение кода выхода.

source: Hexadecimal
ru: Шестнадцатеричное

source: Hexadecimal value of exit code. Format: 0x00000000
ru: Шестнадцатеричное значение кода выхода. Формат: 0x00000000.

source: Constant
ru: Константа

source: Constant of exit code. Format: letters A-Z, numbers, and underscores.
ru: Константа кода выхода. Формат: буквы A-Z, цифры и подчеркивания.

source: Description
ru: Описание

source: Description of exit code.
ru: Описание кода выхода.

source: Internal authentication
ru: Внутренняя проверка подлинности

source: Username for internal authentication.
ru: Имя пользователя для внутренней проверки подлинности.

source: XML output
ru: Вывод XML

source: Protect XML output
ru: Защита вывода XML

source: Use authorization for the XML output.
ru: Использовать авторизацию для вывода XML.

source: Disable XML output
ru: Отключить вывод XML

source: Disable exporting XML and WPI configuration files.
ru: Отключить экспорт файлов конфигурации XML и WPI.

source: Format XML output
ru: Форматирование вывода XML

source: Only useful for debugging purposes.
ru: Полезно только для отладки.

source: Export notes items
ru: Экспортировать заметки элементов

source: Notes of items will only appear as XML comments.
ru: Заметки элементов будут отображаться только как комментарии XML.

source: Export disabled items
ru: Экспортировать выключенные элементы

source: Disabled items will only appear as XML comments.
ru: Отключенные элементы будут отображаться только как комментарии XML.

source: System
ru: Система

source: Auto variable %%%s%%
ru: Автоматическая переменная %%%s%%

source: Create auto variable %%%s%% in packages.
ru: Создаёт автоматическую переменную %%%s%% в пакетах.

source: Search information
ru: Поиск информации

source: Search in any part string
ru: Поиск в любой части строки

source: Default value for flag of search in any part string
ru: Значение по умолчанию для флага поиска в любой части строки

source: Search on LDAP server
ru: Поиск на сервере LDAP

source: Search base of users
ru: База поиска пользователей

source: Distinguished name of the search base object for search employee on LDAP server (e.g. CN=Users,DC=fabrikam,DC=com). Supports autocomplete.
ru: Уникальное имя объекта базы поиска для поиска сотрудника на сервере LDAP (например, CN=Users,DC=fabrikam,DC=com). Поддерживает автозаполнение.

source: Search base of computers
ru: База поиска компьютеров

source: Distinguished name of the search base object for search computers on LDAP server (e.g. CN=Computers,DC=fabrikam,DC=com). Supports autocomplete.
ru: Уникальное имя объекта базы поиска для поиска компьютеров на сервере LDAP (например, CN=Computers,DC=fabrikam,DC=com). Поддерживает автозаполнение.

source: XML output authentication
ru: Проверка подлинности вывода XML

source: Username for the XML protect account.
ru: Имя пользователя для учетной записи защиты XML.

source: Parsing logs and client databases
ru: Разбор журналов и баз данных клиентов

source: Username to connect to the SMB share.
ru: Имя пользователя для подключения к ресурсу SMB.

source: Workgroup or domain
ru: Рабочая группа или домен

source: Workgroup or domain.
ru: Рабочая группа или домен.

source: Server name
ru: Название сервера

source: Server name.
ru: Название сервера.

source: Share name containing logs
ru: Имя общего ресурса, содержащее журналы

source: The name of the SMB share containing the log files, e.g.: wpkg/log.
ru: Имя общего ресурса SMB, содержащего файлы журнала, например: wpkg/log.

source: Share name containing client databases
ru: Имя общего ресурса, содержащее базы данных клиентов

source: The name of the SMB share containing the client database files, e.g.: wpkg/db. <b>Not necessary.</b> The report files containing the console output of the '<i>%s</i>' command, put in the '%s' subdirectory. File name format: <i>%%COMPUTERNAME%%.log</i>
ru: Имя общего ресурса SMB, содержащего файлы базы данных клиента, например: wpkg/db. <b>Не обязательно.</b> Файлы отчетов, содержащие выходные данные комадны консоли '<i>%s</i>', поместите в подкаталог '%s'. Формат имени файла: <i>%%COMPUTERNAME%%.log</i>

source: Enabled
ru: Включено

source: If enabled, this host will appear in hosts (xml) lists.
ru: Если включен, этот хост будет отображаться в списках хостов (xml).

source: Template
ru: Шаблон

source: If enabled, this host is used as a template.
ru: Если включен, этот хост используется в качестве шаблона.

source: Hostname might contain regular expressions as well as well as IP-address ranges. <i>Direct match:</i> This is tried first always. If the hostname matches exactly the value of 'name' this host node is applied to the machine. <i>IP-Ranges:</i> format has to be specified as follows: start[-end].start[-end].start[-end].start[-end], e.g.: 192.168.1.1 192.168.1.1-254 192.168.1-5.20-50 <i>Regular expressions:</i> example: 'test-.*' will match all machines where the hostname is starting with 'test-' string.
ru: Имя хоста может содержать как регулярные выражения, так и диапазоны IP-адресов. <i>Прямое совпадение:</i> пробуется всегда первым. Если имя хоста в точности совпадает со значением имени, этот хост-узел применяется к машине. <i>IP-диапазоны:</i> формат должен быть указан следующим образом: start[-end].start[-end].start[-end].start[-end], например: 192.168.1.1 192.168.1.1-254 192.168.1-5.20-50 <i>Регулярные выражения:</i> пример: 'test -. *' Будет соответствовать всем машинам, где имя хоста начинается со строки 'test-'.

source: The main profile that will always be evaluated for this host.
ru: Основной профиль, который всегда будет рассмотрен для этого хоста.

source: Additional associated profiles
ru: Дополнительные связанные профили

source: Additional profiles associated with the host.
ru: Дополнительные профили, связанные с хостом.

source: Additional notes about this host. Not used by WPKG.
ru: Дополнительные примечания об этом хосте. Не используется WPKG .

source: Computers to generate
ru: Компьютеры для генерации

source: The list of computers from LDAP to create an XML file.
ru: Список компьютеров из LDAP для создания XML файла.

source: Host template
ru: Шаблон хоста

source: Template for creating new host
ru: Шаблон для создания нового хоста

source: Profile template
ru: Шаблон профиля

source: Template for creating new profile
ru: Шаблон для создания нового профиля

source: Use the main profile from the host template
ru: Использовать основной профиль из шаблона хоста

source: Generate
ru: Генерировать

source: URL for download.
ru: URL для загрузки.

source: Timeout
ru: Время ожидания

source: The maximum number of seconds to wait for the action to execute.
ru: Максимальное количество секунд для ожидания выполнения действия.

source: Target
ru: Цель

source: Path to file for saving.
ru: Путь к файлу для сохранения.

source: Expand URL
ru: Развернуть URL

source: Defines whether the url attribute is expanded (ie. environment variables are replaced).
ru: Определяет, будет ли расширен атрибут url (т. е. переменные окружения заменены).

source: Expansion of environment variables in download URLs.
ru: Расширение переменных окружения в URL-адресах загрузки.

source: Command type
ru: Тип команды

source: The type of command to be executed.
ru: Тип команды, которая будет выполнена.

source: The command to be executed.
ru: Команда, которая будет выполнена.

source: The command to be executed. Autocompletion is available for global variables, package variables, console commands like "%ComSpec% /C" and installer command line switches.
ru: Команда, которая будет выполнена. Автодополнение доступно для глобальных переменных, переменных пакета, консольных команд вида "%ComSpec% /C" и ключей командной строки установщика.

source: Work directory
ru: Рабочий каталог

source: The working directory to use when executing this action.
ru: Рабочий каталог, используемый при выполнении этого действия.

source: The kind of action to be executed.
ru: Вид действия, которое нужно выполнить.

source: Unknown
ru: Неизвестный

source: The kind of action to be executed
ru: Вид действия, которое нужно выполнить

source: The name of the type of package action.
ru: Название типа действия пакета.

source: If enabled, this package will appear in packages (xml) lists.
ru: Если включен, этот пакет появится в списках пакетов (xml).

source: If enabled, this package is used as a template.
ru: Если включен, этот пакет используется в качестве шаблона.

source: Unique ID containing only letters, numbers, underscores and hyphens (e.g. fooBarBaz_ultra OR foo-bar-baz-ultra).
ru: Уникальный идентификатор, содержащий только буквы, цифры, символы подчеркивания и дефисы (например, fooBarBaz_ultra ИЛИ foo-bar-baz-ultra).

source: Create a package ID based on his name. Repeated click changes the strategy for creating an ID.
ru: Создать идентификатор пакета, основанный на его имени. Повторный щелчок изменяет стратегию создания идентификатора.

source: Human-readable name that identifies this package (e.g. Foo Bar Baz Ultra Edition).
ru: Человеко-читаемое имя, которое идентифицирует этот пакет (например, Foo Bar Baz Ultra Edition).

source: Revision
ru: Ревизия

source: An positive integer or positive decimal value that denotes the version/revision of this package (e.g. 1 OR 1.0.3). If you have periods in the revision, you must have at least one digit after each period.
ru: Положительное целое или положительное десятичное значение, которое обозначает версию/ревизию этого пакета (например, 1 ИЛИ 1.0.3). Если у вас есть периоды в ревизии, вы должны иметь по крайней мере одну цифру после каждого периода.

source: Priority
ru: Приоритет
