Repository: anklimsk/wpkg-express-2
Catalog: app/Locale/rus/LC_MESSAGES/validation_errors.po
Languages: ru

source: Incorrect package revision
ru: Неверная версия пакета

source: That package revision already exists.
ru: Эта версия пакета уже существует.

source: Incorrect foreign key
ru: Неверный внешний ключ

source: Archive name is invalid.
ru: Недопустимое имя архива.

source: Archive data is invalid.
ru: Недопустимые архивные данные.

source: The configuration key is invalid.
ru: Недопустимый ключ конфигурации.

source: The configuration key already exists.
ru: Ключ конфигурации уже существует.

source: The configuration value is invalid.
ru: Недопустимое значение конфигурации.

source: The language code is invalid.
ru: Недопустимый код языка.

source: The language code already exists.
ru: Код языка уже существует.

source: Message is invalid.
ru: Недопустимое сообщение.

source: Attribute the exit code must be an integer or a string of 'any' or the symbol *.
ru: Атрибут кода выхода должен быть целым числом или строкой 'any' или символом *.

source: The exit code's code already exists for this package action.
ru: Код кода выхода уже существует для этого действия пакета.

source: The exit code is invalid.
ru: Недопустимый код выхода.

source: The exit code already exists.
ru: Код выхода уже существует.

source: The hexadecimal value of the exit code is invalid. Format: 0x00000000.
ru: Недопустимое шестнадцатеричное значение кода выхода. Формат: 0x00000000.

source: The constant name of the exit code is invalid. Format: letters A-Z, numbers, and underscores.
ru: Недопустимое имя константы кода выхода. Формат: буквы A-Z, цифры и подчеркивания.

source: The exit code description is invalid.
ru: Недопустимое описание кода выхода.

source: The reboot type is invalid.
ru: Недопустимый тип перезагрузки.

source: The reboot type already exists.
ru: Тип перезагрузки уже существует.

source: Data name is invalid.
ru: Недопустимое имя данных.

source: The host's name is an invalid regular expression.
ru: Имя хоста является недопустимым регулярным выражением.

source: That host already exists.
ru: Этот хост уже существует.

source: The log's type is invalid.
ru: Недопустимый тип журнала.

source: Log message is invalid.
ru: Недопустимое сообщение журнала.

source: Log date is invalid.
ru: Недопустимая дата журнала.

source: The host name is invalid.
ru: Недопустимое имя хоста.

source: The host name already exists.
ru: Имя хоста уже существует.

source: The log type is invalid.
ru: Недопустимый тип журнала.

source: The log type already exists.
ru: Тип журнала уже существует.

source: Package name is invalid.
ru: Недопустимое имя пакета.

source: The package id must start with a letter or number and only contain: letters, numbers, underscores, and hyphens.
ru: Идентификатор пакета должен начинаться с буквы или цифры и содержать только буквы, цифры, символы подчеркивания и дефисы.

source: That package already exists.
ru: Этот пакет уже существует.

source: Package revision is invalid.
ru: Недопустимая версия пакета.

source: The package's priority attribute is not an integer.
ru: Атрибут приоритета пакета не является целым числом.

source: The package's reboot attribute is invalid.
ru: Недопустимый атрибут перезагрузки пакета.

source: The package's execute attribute is invalid.
ru: Недопустимый атрибут пакета execute.

source: The package's notify attribute is invalid.
ru: Недопустимый атрибут пакета notify.

source: The package's precheck-install attribute is invalid.
ru: Недопустимый атрибут пакета precheck-install.

source: The package's precheck-remove attribute is invalid.
ru: Недопустимый атрибут пакета precheck-remove.

source: The package's precheck-upgrade attribute is invalid.
ru: Недопустимый атрибут пакета precheck-upgrade.

source: The package's precheck-downgrade attribute is invalid.
ru: Недопустимый атрибут пакета precheck-downgrade.

source: Depended on self
ru: Зависит от себя

source: Dependency intersection
ru: Пересечение зависимостей

source: Included on self
ru: Включено в себя

source: Chain on self
ru: В цепочке у себя

source: The action type is invalid.
ru: Недопустимый тип действия.

source: The action type already exists.
ru: Тип действия уже существует.

source: The execute type is invalid.
ru: Недопустимый тип выполнения.

source: The execute type already exists.
ru: Тип выполнения уже существует.

source: The notify type is invalid.
ru: Недопустимый тип уведомления.

source: The notify type already exists.
ru: Тип уведомления уже существует.

source: The precheck type is invalid.
ru: Недопустимый тип предварительной проверки.

source: The precheck type already exists.
ru: Тип предварительной проверки уже существует.

source: The priority name is invalid.
ru: Недопустимое имя приоритета.

source: The priority name already exists.
ru: Имя приоритета уже существует.

source: The priority is not an integer.
ru: Приоритет не является целым числом.

source: The priority already exists.
ru: Приоритет уже существует.

source: Incorrect installation date
ru: Неверная дата установки

source: Incorrect uninstallation date
ru: Неверная дата удаления

source: The profile id must start with a letter or number and only contain: letters, numbers, underscores, and hyphens.
ru: Идентификатор профиля должен начинаться с буквы или цифры и содержать только буквы, цифры, символы подчеркивания и дефисы.

source: That profile already exists.
ru: Этот профиль уже существует.

source: The report's type is invalid.
ru: Недопустимый тип отчёта.

source: That package for this host already exists.
ru: Этот пакет для этого хоста уже существует.

source: Report date is invalid.
ru: Недопустимая дата отчёта.

source: Hash is invalid.
ru: Недопустимый хэш.

source: The report state is invalid.
ru: Состояние отчёта недействительно.

source: The report state already exists.
ru: Состояние отчёта уже существует.

source: Invalid variable type.
ru: Недопустимый тип переменной.

source: Invalid variable reference ID.
ru: Недопустимый ссылающийся идентификатор переменной.

source: The variable name attribute is invalid.
ru: Недопустимый атрибут имени переменной.

source: The variable value attribute is invalid.
ru: Недопустимый атрибут значения переменной.

source: The package already exists.
ru: Этот пакет уже существует.

source: The package's default state must be true or false.
ru: Состояние по умолчанию для пакета должно быть истинным или ложным.

source: The package's force state must be true or false.
ru: Принудительное состояние для пакета должно быть истинным или ложным.

source: The WPI category is invalid.
ru: Недопустимая категория WPI.

source: The WPI category already exists.
ru: Категория WPI уже существует.
